peterzhenghj/circuitpython/ports/espressif/boards/lckfb_esp32s3_n8r8/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "LCKFB ESP32S3-N8R8"
#define MICROPY_HW_MCU_NAME         "ESP32S3"

#define MICROPY_HW_LED_STATUS       (&pin_GPIO10)
#define MICROPY_HW_LED_STATUS_INVERTED (1)
